<template>
  <div class="XhDestoryCount-cs">
    <div class="header-cs">
      <span class="iconfont icon-fanhui" @click="$router.back()"></span>
      <span class="set-cs">用户注销协议</span>
    </div>
    <p>
      新华书店网上商城账号注销协议

      【特别说明】亲爱的用户，在您正式开始下一步新华书店网上商城账号注销流程前，我们先为您做出如下特别说明：注销新华书店网上商城账号后，您将无法再以此账号登录和使用新华书店网上商城（以下简称“我们”）的所有产品与服务以及产品及服务中与第三方合作的服务内容（以下简称为“新华书店网上商城的产品与服务”，例如“新华书店网上商城”、“新华读佳”等），新华书店网上商城也将同时终止在该账号下为您提供的产品与服务。且新华书店网上商城账号一旦注销完成，将无法恢复。请您在注销前慎重考虑。

      若您经过慎重考虑后仍执意决定注销新华书店网上商城账号的，请您务必先行仔细阅读和充分理解本《新华书店网上商城账号注销协议》，在同意全部内容、且在账号符合全部注销条件后，按照我们的注销操作指引点击进行下一步操作，您勾选本注销协议并点击下一步操作的，即视为您已经同意并签署和遵守本协议全部内容。如您在注销后需要再次使用我们的服务的，欢迎您使用手机号码或我们允许的其他方式重新注册。

      一、您需要首先知悉的是：在您的新华书店网上商城账号注销后，将（可能）产生包括但不限于如下结果需要您自行承担：

      1. 新华书店网上商城账号一旦注销，您将无法登录、使用该账号（也包括无法再使用第三方登录方式），也就是说您将无法再以此账号登录/使用/继续使用新华书店网上商城的所有产品与服务。

      2. 新华书店网上商城账号一旦注销，您曾通过该账号登录、使用的新华书店网上商城的产品与服务下的所有内容、信息、数据、记录将会被全部删除或匿名化处理，您也无法再检索、访问、获取、继续使用和找回，也无权要求我们找回（但法律法规另有约定的除外），包括但不限于：

      l  该账号下的个人资料（例如：头像、昵称等）及绑定信息（例如：绑定手机号、邮箱等）；

      l  该账号下的您的个人隐私信息（同时您亦不再享有《新华书店网上商城隐私政策》中约定的您的用户权利，但法律法规另有约定的除外）；

      l  该账号曾发表的所有内容（例如：图片、照片、评论、互动等）；

      l  其他所有内容、信息、数据、记录（例如：订单信息、发票信息、学习进度、家庭藏书、收藏、浏览记录等）。

      3. 您同意通过注销账号的方式放弃该账号在新华书店网上商城的产品与服务使用期间已产生的但未消耗完毕的权益及未来的逾期利益。即新华书店网上商城账号一旦注销，我们将会对该账号下的全部权益做清除处理，包括但不限于：

      l  您尚未使用的积分、卡券、优惠券等；

      l  您钱包里充值的虚拟货币；

      l  您在新华书店网上商城的产品与/或服务中发布的内容未来的收益权益；

      l  您在新华书店网上商城的产品与/或服务中的购买的购物卡等各类权益；

      l  您在新华书店网上商城的产品与/或服务中已经购买的电子书、音视频在线服务内容等；

      l  其他已产生但未消耗完毕的权益或未来预期的收益。

      4. 新华书店网上商城账号一旦注销，将无法恢复（即使您在注销后以相同手机号码再次向我们申请注册新华书店网上商城账号，此时该账号将默认为新的用户账号。因此，我们善意地提醒您在申请注销前对需要备份的内容提前自行做好备份）。

      5. 新华书店网上商城账号一旦注销，您与我们曾签署过的相关用户协议、其他权利义务性文件等相应终止（但已约定继续生效的或法律法规另有规定的除外）。

      6.其他因新华书店网上商城账号注销（可能）产生的结果。

      二、在您向我们申请/继续申请注销新华书店网上商城账号之前，为保障您的账号安全和财产权益，您需先行检查与确保您申请注销的账号已经同时满足以下条件，这些条件包括但不限于：

      1.该账号是通过我们的官方渠道注册、符合《新华书店网上商城服务协议》及相关平台说明规范的账号，且为您本人注册的账号。

      2.需按照我们的官方渠道提供的注销流程和操作指引进行注销操作。

          3.该账号处于安全状态，包括但不限于：

      l  最近3个月内无异常登录记录；

      l  最近3个月内未换绑注册手机、邮箱；

      l  无其他不安全/异常状态。

      4.该账号内无未处理完毕的交易，包括但不限于：

      l  该账号未开通任何商家、品牌商服务；

      l  该账号无未完成的订单；

       5．其他应满足的条件。

      三、如何注销新华书店网上商城账号？

      1. 您需按照我们的官方渠道提供的注销流程和操作指引，在相关功能设置页面进行注销操作。

      2. 您已经仔细阅读与充分理解、且同意本《注销协议》的全部内容；同时，您已经检查与确认满足了本协议第二条的要求。

      3. 在您完成上述第2点后，我们将根据您的账号安全状态以及您的相关产品与服务的使用情况等综合判断您的账号是否符合注销条件。如满足注销条件，为保障您的账号安全和财产权益，我们需要进行注销申请的身份验证以确保您真的是账号的有权使用人（如注册手机验证方式等）。如我们在综合判断后发现账号不符合注销条件的，或者身份验证失败的，您的注销可能会失败。

      4. 我们在您成功完成上述第3点的“身份验证”后，视为您已成功向我们提交了新华书店网上商城账号注销申请，该账号将被永久注销。

      本协议未尽事宜，请参考《新华书店网上商城服务协议》、《新华书店网上商城隐私政策》及平台相关规则、说明等。同时，您知悉并同意：即使您的新华书店网上商城账号被注销了，也并不减轻或免除您应根据相关法律法规、相关协议、规则等（可能）需要承担的相关责任。

      本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。因本协议产生之争议，双方尽最大诚意进行友好协商，如果双方不能协商一致，任何一方均有权向新华书店网上商城所属地的法院提起诉讼。
    </p>
    <div class="bottom-cs">
      <button>不同意</button>
      <button>同意</button>
    </div>
  </div>
</template>

<script>
  export default {
    name: "XhDestoryCount"
  }
</script>

<style scoped>
  /*@import '../assets/css/XhStyleOne.css';*/

  .XhDestoryCount-cs {
    background-color: #f7f7f7;
    height: 100%;
    width: 100%;
    text-align: center;
    padding: 0 0.3rem;
    font-size: 15px;
    display: flex;
    flex-direction: column;
  }

  .XhDestoryCount-cs .header-cs {
    font-size: 16px;
    height: 0.8rem;
    line-height: 0.8rem;
    /*background-color: red;*/
  }

  .XhDestoryCount-cs .header-cs .icon-fanhui {
    float: left;
    color: red;
  }

  .XhDestoryCount-cs .header-cs .set-cs {
    margin-right: 0.16rem;

  }

  .XhDestoryCount-cs p {
    flex: 1;
    overflow-y: scroll;
  }

  .XhDestoryCount-cs .bottom-cs {
    padding: 0;
    height: 0.9rem;
    width: 100%;
    position: fixed;
    bottom: 0;
    left: 0;
  }

  .XhDestoryCount-cs .bottom-cs button {
    width: 50%;
    height: 100%;
    border: none;
    padding: 0;
    float: left;
  }

  .XhDestoryCount-cs .bottom-cs button:first-child {
    color: #c0c0c0;
    background-color: #ffffff;
  }

  .XhDestoryCount-cs .bottom-cs button:last-child {
    color: white;
    background-color: #c72f2e;
  }

</style>
